Firma/nalog_encrypted_and_signed.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><ns2:getNalogZaPlacanjeRequest xmlns:ns2="http://nalogZaPlacanje.com"><xenc:EncryptedData xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" Type="http://www.w3.org/2001/04/xmlenc#Content"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#tripledes-cbc"/><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:KeyName>Sifrovan tajni kljuc</ds:KeyName>
<xenc:EncryptedKey><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-1_5"/><xenc:CipherData><xenc:CipherValue>iyi6n2ZXC8ZLtvkLJn8LbOa3ErM2ME3lHGVETWjPNqQVeqKTyJX6IbfdDCdWgh1w8IfjO84Sywhp&#13;
87MizY8UjsHdCDspo+sYlluhQL1Ok8C7SkpzrPs2JtZfJpDV/N38/eR+cA5+jCl9iV+vh7X41IvD&#13;
IExgvf4lV6Mv7L05wQ4=</xenc:CipherValue></xenc:CipherData></xenc:EncryptedKey></ds:KeyInfo><xenc:CipherData><xenc:CipherValue>/XdUk1TLAKqG4TOtGSG0TwwEm+P2NNgAZIBGmA6BakXKEOhCOVxREf/1ucVMDqj9+E9fySWEkLna&#13;
qDH2jFyU2vTOesdvPIb/YFAHZRJhikInXZrGlSrJTiCpocnHMec6ptFdd+Zt6HIj9KKNe8P+PMcp&#13;
/yUsBPdkLA/nasR9VkddzxerzA27Bp1OcO9qw5pcTLHLtL3AURpeFGgCYfKLGwtBOX6fs5IOFYSs&#13;
QUQRGIYL7aFBL8IaoBxu3+doJvOAobR9/Mfh8Eoh1PbNEU5YWCJ6hcBBcfbTk+3qVQ0sKvTsDVG2&#13;
Do12kzY3KVXoWTwlDO72Sa5RU4UzzMVuiGq4OkjfwoENoMFEZwYaLpPHpoKBzijPWE9W8p08fDz1&#13;
NP5MDR2rtH2es4jICsL3iMnHHHzpbIYbYuKN5PQwqcaL45RJKOzhGEckxw60MH8oGhd4E5UU0wTc&#13;
EsMGDyVqeLspcUfnlr88lUoNUXet4phcMDnl1qEDsIJjdULxNBUUgjRgKDPqr7CuwV5PhfZqCb2h&#13;
LCX4EV81HObo0Jh4QgYdWWnqx5enonK7FPUd6tE18BpZIRUmNdW4nEUI1o1eJj70QI+5fEogre1I&#13;
F0R2zwhPd5jcC09xXNS2lUGbctWJFahh8w96oWzkyPGyQ20w9Ibj0D7+Sw5zHtJmXTeuM70nzPpa&#13;
wi+gUOktf4IR+pZFJtn08GYxj6QiiE3zfGR8SbwifKgX92KR7nxmlo5FNsuip9hGeFdqdSKBQrup&#13;
Q6Il4zTKZZyDJX4hUKMfibmj/b8ar+tuckNFL3Rj2rCNqP34fFpG6aLyQZC1UmQ94P1V4ZCoYNRT&#13;
TtvbNEesrzfUuMBAo4eCU5LToDt7OYDRknMiHk9883XALeKUT/77dVZwnvWCNTuLL8icWlQDtkAB&#13;
ipWaDSf/TCL6ImakXLv53aLz7Uh/XP9cEFOFXlMCBDQKLNAZ</xenc:CipherValue></xenc:CipherData></xenc:EncryptedData></ns2:getNalogZaPlacanjeRequest></SOAP-ENV:Body><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:SignedInfo>
<ds:CanonicalizationMethod Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315"/>
<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
<ds:Reference URI="">
<ds:Transforms>
<ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
<ds:Transform Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315#WithComments"/>
</ds:Transforms>
<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
<ds:DigestValue>AEsjknf/+ITjoel7JTy2s1X794I=</ds:DigestValue>
</ds:Reference>
</ds:SignedInfo>
<ds:SignatureValue>
nOQr47cS4MBTE1ZjwWxIqYC4yxDu2j8URS8XnhYPtpFmqE5KKcX5EqqK8oqvhjDwWPq+B85xM1Wu&#13;
7Z46KPx/OxsRSztnY/PNUBog6qbi2PnCC1jyShQrzwYrNcbYqEJTAiP3Tf3+8pk9qOFjwhtc2N6D&#13;
oueERswo1uk3NFTB0rY=
</ds:SignatureValue>
<ds:KeyInfo>
<ds:KeyValue>
<ds:RSAKeyValue>
<ds:Modulus>
zQ9KJLShafi/S2HkWlfnRpKcuLB4BgeJ5y2wBafGRRNz5kss0gjzzQZIDf684gwQ2WYEDlH2s+OX&#13;
fbX4v6KTKJ4ug0wfY05sciJ7Dx+HOPUw6KU5aWvbBIKAXJE+MCSaO/FSk+ujgXSZAY/epUsSqBo2&#13;
EZgUl90oEpTRbV+xX8E=
</ds:Modulus>
<ds:Exponent>AQAB</ds:Exponent>
</ds:RSAKeyValue>
</ds:KeyValue>
<ds:X509Data>
<ds:X509Certificate>
MIIBtjCCAR8CBEZasCQwDQYJKoZIhvcNAQEFBQAwIjEPMA0GA1UECwwGcHJpbWVyMQ8wDQYDVQQD&#13;
DAZwcmltZXIwHhcNMDcwNTI4MTAzNDEyWhcNMjcwNTIzMTAzNDEyWjAiMQ8wDQYDVQQLDAZwcmlt&#13;
ZXIxDzANBgNVBAMMBnByaW1lcjCBnzANBgkqhkiG9w0BAQEFAAOBjQAwgYkCgYEAzQ9KJLShafi/&#13;
S2HkWlfnRpKcuLB4BgeJ5y2wBafGRRNz5kss0gjzzQZIDf684gwQ2WYEDlH2s+OXfbX4v6KTKJ4u&#13;
g0wfY05sciJ7Dx+HOPUw6KU5aWvbBIKAXJE+MCSaO/FSk+ujgXSZAY/epUsSqBo2EZgUl90oEpTR&#13;
bV+xX8ECAwEAATANBgkqhkiG9w0BAQUFAAOBgQB2HjPI427zRaVfLTaeNVcjH9hoTkl9OUJAAmEa&#13;
6EQdbdqZ75ca3IfuLHJFJ8zzyBP4LUGSxgA4OpnKs6Ej5w2n0GHmu0g4YqxInfpv/kCwswoia4Oz&#13;
a17te8mMamffCn3ySX5yZzEex5nueNAyhJkmWBcBCOvJw4+U+gSK50Xbcw==
</ds:X509Certificate>
</ds:X509Data>
</ds:KeyInfo>
</ds:Signature></SOAP-ENV:Envelope>